# RbsElecAnalyticalArea Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecAnalyticalArea Property
ParameterTypeId Class See Also
---
"Area"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecAnalyticalArea { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecAnalyticalArea As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecAnalyticalArea {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace